Repository: sl-design-system/components
Catalog: packages/locales/src/*.xlf
Languages: nl

# sl.breadcrumbs.navigationLabel
source: Breadcrumb trail
nl: Kruimelpad

# sl.breadcrumbs.moreButton
source: More breadcrumbs
nl: Meer links

# sl.tabGroup.showAllTabsButton
source: Show all
nl: Toon alles

# sl.tagList.hiddenElementsTooltip
source: List of hidden elements
nl: Lijst met verborgen elementen

# sl.tree.loadingMessage
source: Loading
nl: Laden

# sl.tag.removalInstructions
source: Press the delete or backspace key to remove this item
nl: Druk op de delete- of backspacetoets om dit item te verwijderen

# sl.combobox.selectedOptionsLabel
source: Selected options
nl: Geselecteerde opties

# sl.combobox.toggleOptionsButtonLabel
source: ${this.listbox?.matches(':popover-open') ? 'Hide' : 'Show'} the options
nl: ${this.listbox?.matches(':popover-open') ? 'Verberg' : 'Toon'} de opties

# sl.common.selected
source: Selected
nl: Geselecteerd

# sl.common.allOptions
source: All options
nl: Alle opties

# sl.dateField.toggleCalendarButtonLabel
source: Toggle calendar
nl: Toon kalender

# sl.common.close
source: Close
nl: Sluiten

# sl.emojiBrowser.search
source: Search
nl: Zoeken

# sl.formControl.validation.invalidValue
source: Please enter a valid value.
nl: Voer een correcte waarde in.

# sl.formControl.validation.patternMismatch
source: Please match the format requested.
nl: Voer een waarde in volgens het gevraagde patroon.

# sl.formControl.validation.valueMissing
source: Please fill in this field.
nl: Voer een waarde in.

# sl.gridGroupHeader.toggleGroupButtonLabel
source: Toggle group
nl: Toon groep

# sl.gridFilterColumn.blankOptionLabel
source: Blank
nl: Leeg

# sl.gridSorter.sortDescendingButtonLabel
source: Sort descending
nl: Sorteer aflopend

# sl.gridSorter.removeSortButtonLabel
source: Remove sort
nl: Verwijder sortering

# sl.gridSorter.sortAscendingButtonLabel
source: Sort ascending
nl: Sorteer oplopend

# sl.gridFilter.filterBySelectPlaceholder
source: Filter by ${this.#getFilterHeaderValue()}
nl: Filter op ${this.#getFilterHeaderValue()}

# sl.gridSelectionColumn.selectAllRowsChecboxLabel
source: Select all rows
nl: Selecteer alle rijen

# sl.grid.skipToEndLinkLabel
source: Skip to end of table
nl: Naar het einde van de tabel

# sl.grid.selectionStatusMessage
source: ${this.selection.selected} of ${this.selection.size} selected
nl: ${this.selection.selected} van ${this.selection.size} geselecteerd

# sl.grid.skipToStartLinkLabel
source: Skip to start of table
nl: Naar het begin van de tabel

# sl.gridSelectionColumn.selectRowCheckboxLabel
source: Select row
nl: Selecteer rij

# sl.messageDialog.alertTitle
source: Alert
nl: Mededeling

# sl.messageDialog.confirmTitle
source: Confirm
nl: Bevestig

# sl.messageDialog.cancelButton
source: Cancel
nl: Annuleren

# sl.numberField.stepDownFieldButtonLabel
source: Step down
nl: Stap omlaag

# sl.numberField.stepUpFieldButtonLabel
source: Step up
nl: Stap omhoog

# sl.numberField.validation.exceedsMaximum
source: The value must be less than or equal to ${this.max}.
nl: De waarde moet kleiner dan of gelijk aan ${this.max} zijn.

# sl.numberField.validation.belowMinimum
source: The value must be greater than or equal to ${this.min}.
nl: De waarde moet groter dan of gelijk aan ${this.min} zijn.

# sl.numberField.validation.invalidNumber
source: Please enter a valid number.
nl: Voer een geldig getal in.

# sl.paginator.itemsPerPageLabel
source: Items per page:
nl: Items per pagina:

# sl.paginator.itemsPerPageOptionLabel
source: items per page
nl: items per pagina

# sl.paginator.paginationLabel
source: Pagination
nl: Paginering

# sl.paginator.previousPageButtonLabel
source: Go to the previous page (${this.page})
nl: Ga naar vorige pagina (${this.page})

# sl.paginator.selectPageNumberMenuLabel
source: Select page number
nl: Selecteer paginanummer

# sl.paginator.currentPageSelectLabel
source: ${this.page}, page
nl: ${this.page}, pagina

# sl.paginator.pageSelectLabel
source: ${index + 1}, page
nl: ${index + 1}, pagina

# sl.paginator.totalPagesLabel
source: of ${this.pageCount} pages
nl: van ${this.pageCount} pagina's

# sl.paginator.nextPageButtonLabel
source: Go to the next page (${this.page + 2})
nl: Ga naar de volgende pagina (${this.page + 2})

# sl.paginator.pageAnnouncementLabel
source: Page ${this.page + 1} of ${this.pageCount}
nl: Pagina ${this.page + 1} van ${this.pageCount}

# sl.panel.expandPanelToggleButtonLabel
source: Expand panel
nl: Uitklappen

# sl.panel.collapsePanelToggleButtonLabel
source: Collapse panel
nl: Inklappen

# sl.progressBar.stateLabel
source: state
nl: status

# sl.progressBar.activeState
source: active
nl: actief

# sl.progressBar.successState
source: success
nl: succes

# sl.progressBar.warningState
source: warning
nl: waarschuwing

# sl.progressBar.errorState
source: error
nl: fout

# sl.radioGroup.validation.required
source: Please select an option.
nl: Kies een optie.

# sl.searchField.clearButtonLabel
source: Clear text
nl: Wis tekst

# sl.selectButton.clearSelectionButtonLabel
source: Clear selection
nl: Selectie wissen

# sl.toolBar.showMoreButtonLabel
source: Show more
nl: Meer tonen

# sl.common.validation.tooShort
source: Please enter at least ${this.minLength} characters (you currently have ${length} character${length > 1 ? 's' : ''}).
nl: Voer tenminste ${this.minLength} karakters in (je hebt op dit momoment ${length} karakter${length > 1 ? 's' : ''}).

# sl.select.validation.required
source: Please choose an option from the list.
nl: Kies een optie uit de lijst.

# sl.paginatorStatus.itemsRange
source: ${start} - ${end} of ${this.totalItems} items
nl: ${start} - ${end} van ${this.totalItems} items

# sl.paginatorStatus.currentlyShowingAmountAnnouncement
source: Currently showing ${start} to ${end} of ${this.totalItems} items
nl: Momenteel worden ${start} tot ${end} van ${this.totalItems} weergegeven

# sl.checkboxGroup.validation.valueMissing
source: Please check at least one option.
nl: Vink tenminste één optie aan.

# sl.checkbox.validation.valueMissing
source: Please check this box.
nl: Vink dit vakje aan.

# sl.combobox.validation.valueMissingMultiple
source: Please select at least one option.
nl: Selecteer tenminste één optie.

# sl.combobox.validation.valueMissing
source: Please select an option.
nl: Kies een optie.

# sl.combobox.createCustomOption
source: Create "${this.value}"
nl: Maak "${this.value}" aan

# sl.combobox.noOptionsFoundMessage
source: No options starting with "${this.value}" have been found.
nl: Geen opties gevonden die beginnen met "${this.value}".

# sl.emojiBrowser.frequentlyUsed
source: Frequently Used
nl: Vaak gebruikt

# sl.form.allFieldsValid
source: All fields are valid.
nl: Alle velden zijn correct.

# sl.form.errorsListHeader
source: The following fields have errors:
nl: De volgende velden bevatten fouten:

# sl.form.optionalLabelIndicator
source: optional
nl: optioneel

# sl.form.requiredLabelIndicator
source: required
nl: verplicht

# sl.grid.cancelSelection
source: Cancel selection
nl: Annuleer selectie

# sl.calendar.previousYear
source: Previous year, ${currentYear - 1}
nl: Vorig jaar, ${currentYear - 1}

# sl.calendar.nextYear
source: Next year, ${currentYear + 1}
nl: Volgend jaar, ${currentYear + 1}

# sl.calendar.previousYears
source: Go back 12 years
nl: Ga 12 jaar vooruit

# sl.calendar.nextYears
source: Go forward 12 years
nl: Ga 12 jaar terug
